# SetFilters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..SetFilters Method
ScheduleDefinition Class See Also
---
Replaces all filters in this ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetFilters(
	IList<ScheduleFilter> filters
)
```

Visual Basic
---
```text
Public Sub SetFilters ( _
	filters As IList(Of ScheduleFilter) _
)
```

Visual C++
---
```text
public:
void SetFilters(
	IList<ScheduleFilter^>^ filters
)
```

# ### Parameters
filters
    Type: System.Collections.Generic..::..IList<(Of <(<'ScheduleFilter>)>)> The new list of filters.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The resulting filter count would be greater than 8. -or- A field ID is not the ID of a field in this ScheduleDefinition. -or- A field and filter type cannot be used to filter this ScheduleDefinition. -or- A filter value is not valid for the field and filter type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This ScheduleDefinition does not support filters. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace